Nama: Amelia Nurmadani, NIM: 200601110087

Pandas adalah sebuah library berlisensi BSD dan open source yang menyediakan struktur data dan analisis data yang mudah digunakan dan berkinerja tinggi untuk bahasa pemrograman Python.

DataFrame

Struktur data dasar pandas dinamakan DataFrame. Koleksi kolom berurutan dengan bentuk sebuah tabel yang tampak seperti database dimana sebuah baris tunggal mewakili atribut tertentu. Dengan adanya fitur DataFrame memudahkan untuk memebaca sebua file dan menjadikannya table.

Apa saja yang bisa dilakukan pandas?

1. read from and write to CSV, other file and databases.
2. calculate statistics and answer questions about the data.
3. clean the data by doing things like removing missing values and filtering rows or columns by some criteria visualize the data with help from matplotlib.
4. dapat mengolah data dengan menggunakan operasi seperti join, distinct, group by, agregasi, dan teknik lainnya yang terdapat pada SQL.

Install dan Import

- INSTAL: conda install pandas atau pip install pandas
- IMPORT: import pandas, atau biasanya untuk menyingkat penulisan saat diakses maka diberi nama alias, misalnya "pd". import pandas as pd

Komponen utama pandas.
series dan dataframe. 
series adalah suatu kolom.
dataframe adalah kumpulan series, dapat berupa tabel multidimensi.

Pembuatan dataframe.
Dataframe dapat terbentuk berasal dari hasil pembacaan data atau bisa juga dibuat sendiri. banyak cara untuk membuat dataframe, paling sederhana yaitu dengan menggunakan struktur data dict dalam python.

setiap (key, value) item di data terhubung dengan column dalam hasil akhir DataFrame. Index di dataframe ini otomatis terbentuk berupa angka 0-3

penambahan index sesuai keinginan kita:

purchases = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])

Fungsi lain
1. df.head() #pengambilan 5 data pertama
2. df.head(10) #pengambilan 10 data pertama
3. df.tail(8) #pengambilan 8 data terakhir
4. df.columns #menampilkan nama kolom
5. df[['nama','alamat']] #pilih kolom tertentu
6. mengacu ke data sebelumnya: 
    1. purchases["oranges"].min() #data terkecil
    2. purchases["oranges"].max() #data terbesar
    3. purchases["oranges"].mean() #rata rata
    4. purchases["oranges"].sum() #jumlah
    5. purchases["oranges"].count() #cacah
    6. purchases[purchases['oranges']==3] #filter data

Operator Logical

logical operators | untuk "or" dan & untuk "and".

df[(df['jur']=='SI') | (df['jur']=='TI')].head()

penggunaan isin

df[df['jur'].isin([isin(['SI', 'TI'])].head()

Mengimpor Pandas

import pandas as pd

Import txt. Siapkan dahulu file txt (dengan jarak antar data misal menggunakan tab) di folder yang sama dengan program.

contoh code: 
 data1.pd.read_csv("data.txt")
 print(data1)

Import CSV. Siapkan dahulu file CSV di folder yang sama dengan program

contoh code: data.pd.read_csv{"data.txt"}
print{data}

Import xlsx. Siapkan dahulu file xlsx di folder yang sama dengan program

contoh code: data.pd.read_excel('data.xlsx')
print(data)

Membuat DataFrame sendiri

In [10]:
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [9]:
import pandas as pd 
data = [1,2,3,4,5]
df1 = pd.DataFrame(data)
print(df1)

   0
0  1
1  2
2  3
3  4
4  5

In [11]:
import pandas as pd
data = [['purwanto', 32],['purnomo',43],['purwo',55]]
df2 = pd.DataFrame(data,columns=['nama','usia'])
print(df2)

       nama  usia
0  purwanto    32
1   purnomo    43
2     purwo    55

Memanggil data tertentu pada dataframe.misal kita memiliki dataframe sebagai berikut:

In [12]:
import pandas as pd
data = [['purwanto', 32],['purnomo',43],['purwo',55]]
df2 = pd.DataFrame(data,columns=['nama','usia'])
print(df2)

       nama  usia
0  purwanto    32
1   purnomo    43
2     purwo    55

lalu kita ingin memanggil kolom tertentu

In [13]:
df2['nama']

0    purwanto
1     purnomo
2       purwo
Name: nama, dtype: object

In [14]:
df2['usia']

0    32
1    43
2    55
Name: usia, dtype: int64

In [15]:
df2.iloc[0][0]

'purwanto'

In [16]:
df2.iloc[0]['nama']

'purwanto'

In [17]:
df2.at[0,'nama']

'purwanto'

In [18]:
df2.iat[0,0]

'purwanto'

In [19]:
df2.iloc[0]

nama    purwanto
usia          32
Name: 0, dtype: object

In [20]:
df2.loc[:,'nama']

0    purwanto
1     purnomo
2       purwo
Name: nama, dtype: object

Set Index

In [22]:
df3 = pd.DataFrame([['purwanto',32],['purnomo',43],['purwo',55]],columns=['nama','usia'])
df3

       nama  usia
0  purwanto    32
1   purnomo    43
2     purwo    55

In [23]:
df3.set_index('nama')

          usia
nama
purwanto    32
purnomo     43
purwo       55

Pemanggil baris

In [25]:
import pandas as pd
import numpy as np
df4 = pd.DataFrame(data=np.array([[1,2,3], [4,5,6], [7,8,9]]), index= [2,'A',4], columns=[48,49,50])
df4

   48  49  50
2   1   2   3
A   4   5   6
4   7   8   9

In [26]:
df4.loc[2]

48    1
49    2
50    3
Name: 2, dtype: int32

In [27]:
df4.iloc[2]

48    7
49    8
50    9
Name: 4, dtype: int32

Menambah Kolom

In [28]:
#menambah index di kolom baru
df5 = pd.DataFrame([['purwanto',32],['purnomo',43],['purwo',55]],columns=['nama','usia'])
df5['index']=df5.index
df5

       nama  usia  index
0  purwanto    32      0
1   purnomo    43      1
2     purwo    55      2

In [30]:
#menambahkan kolom dengan isian baru
df5.loc[:,'gender'] = pd.Series(['L','L','L'])
df5

       nama  usia  index gender
0  purwanto    32      0      L
1   purnomo    43      1      L
2     purwo    55      2      L

Melihat ukuran DataFrame

In [31]:
#ukuran baris paling panjang
len(df2)

3

In [32]:
#ukuran baris pada kolom tertentu
len(df2['nama'])

3

In [33]:
#ukuran baris, ukuran kolom dataframe
print(df2.shape)

(3, 2)

Menghapus

In [34]:
df6 = pd.DataFrame([['purwanto',32],['purnomo',43],['purwo',55]],columns=['nama','usia'])
df6

       nama  usia
0  purwanto    32
1   purnomo    43
2     purwo    55

In [35]:
#menghapus kolom
del df6['nama']
df6

   usia
0    32
1    43
2    55

In [36]:
#menghapus n baris di awal
df6=df6[2:]
df6

   usia
2    55

In [37]:
df6 = pd.DataFrame([['purwanto',32],['purnomo',43],['purwo',55]],columns=['nama','usia'])
df6

       nama  usia
0  purwanto    32
1   purnomo    43
2     purwo    55

In [38]:
#menghapus baris tertentu
df6=df6.drop(df6.index[[0,2]])
df6

      nama  usia
1  purnomo    43

Ekspor DataFrame

In [1]:
#import pandas dan numpy
import pandas as pd
import numpy as np
#misal punya suatu dataframe
data = [[1,32],[2,43],[4,55]]
df = pd.DataFrame(data, columns=['nama','usia'])
#convert ke numpy array
databaru= df.to_numpy()
print(databaru)
#convert ke txt
df.to_csv('dataexport.csv')

[[ 1 32]
 [ 2 43]
 [ 4 55]]